ModuleID = 'ld-temp.o'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.YkLocation = type { i64 }

@stderr = external dso_local local_unnamed_addr global ptr, align 8
@.str = private unnamed_addr constant [10 x i8] c"udiv %hd\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [10 x i8] c"udiv2 %d\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [11 x i8] c"udiv3 %ld\0A\00", align 1, !dbg !9
@.str.3 = private unnamed_addr constant [10 x i8] c"udiv4 %u\0A\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [6 x i8] c"exit\0A\00", align 1, !dbg !16
@shadowstack_0 = thread_local global ptr null

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i32 @main(i32 noundef %0, ptr nocapture noundef readnone %1) #0 !dbg !31 {
  call void @__yk_trace_basicblock_dummy(i32 0, i32 0)
  %3 = call ptr @malloc(i64 1000000)
  %4 = getelementptr i8, ptr %3, i32 25
  store ptr %4, ptr @shadowstack_0, align 8
  %5 = alloca %struct.YkLocation, align 8
  %6 = getelementptr i8, ptr %3, i32 0
  %7 = getelementptr i8, ptr %3, i32 4
  %8 = getelementptr i8, ptr %3, i32 8
  %9 = getelementptr i8, ptr %3, i32 16
  %10 = getelementptr i8, ptr %3, i32 24
  br label %11, !dbg !76

11:                                               ; preds = %2
  call void @__yk_trace_basicblock_dummy(i32 0, i32 1), !dbg !77

!70 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!71 = !DILocalVariable(name: "udiv", scope: !72, file: !2, line: 95, type: !55)
!72 = distinct !DILexicalBlock(scope: !31, file: !2, line: 93, column: 17)
!73 = !DILocalVariable(name: "udiv2", scope: !72, file: !2, line: 96, type: !61)
!74 = !DILocalVariable(name: "udiv3", scope: !72, file: !2, line: 97, type: !65)
!75 = !DILocalVariable(name: "udiv4", scope: !72, file: !2, line: 98, type: !68)
!76 = !DILocation(line: 0, scope: !31)
!77 = !DILocation(line: 78, column: 14, scope: !31)
!78 = !DILocation(line: 79, column: 3, scope: !31)
!79 = !DILocation(line: 80, column: 3, scope: !31)
!80 = !DILocation(line: 80, column: 14, scope: !31)
!81 = !DILocation(line: 80, column: 20, scope: !31)
!82 = !DILocation(line: 82, column: 3, scope: !31)
!83 = !DILocation(line: 82, column: 7, scope: !31)
!84 = !{!85, !85, i64 0}
!85 = !{!"int", !86, i64 0}
!86 = !{!"omnipotent char", !87, i64 0}
!87 = !{!"Simple C/C++ TBAA"}
!88 = !DILocation(line: 83, column: 3, scope: !31)
!89 = !DILocation(line: 83, column: 12, scope: !31)
!90 = !{!91, !91, i64 0}
!91 = !{!"short", !86, i64 0}
!92 = !DILocation(line: 84, column: 3, scope: !31)
!93 = !DILocation(line: 84, column: 12, scope: !31)
!94 = !DILocation(line: 85, column: 3, scope: !31)
!95 = !DILocation(line: 85, column: 12, scope: !31)
!96 = !{!97, !97, i64 0}
!97 = !{!"long", !86, i64 0}
!98 = !DILocation(line: 86, column: 3, scope: !31)
!99 = !DILocation(line: 86, column: 11, scope: !31)
!100 = !{!86, !86, i64 0}
!101 = !DILocation(line: 87, column: 3, scope: !31)
!102 = !{i64 2147881182}
!103 = !DILocation(line: 88, column: 3, scope: !31)
!104 = !{i64 2147881230}
!105 = !DILocation(line: 89, column: 3, scope: !31)
!106 = !{i64 2147881278}
!107 = !DILocation(line: 90, column: 3, scope: !31)
!108 = !{i64 2147881326}
!109 = !DILocation(line: 91, column: 3, scope: !31)
!110 = !{i64 2147881374}
!111 = !DILocation(line: 92, column: 3, scope: !31)
!112 = !{i64 2147881421}
!113 = !DILocation(line: 93, column: 10, scope: !31)
!114 = !DILocation(line: 93, column: 12, scope: !31)
!115 = !DILocation(line: 93, column: 3, scope: !31)
!116 = !DILocation(line: 94, column: 5, scope: !72)
!117 = !DILocation(line: 95, column: 21, scope: !72)
!118 = !DILocation(line: 0, scope: !72)
!119 = !DILocation(line: 96, column: 22, scope: !72)
!120 = !DILocation(line: 96, column: 27, scope: !72)
!121 = !DILocation(line: 97, column: 22, scope: !72)
!122 = !DILocation(line: 97, column: 27, scope: !72)
!123 = !DILocation(line: 98, column: 21, scope: !72)
!124 = !DILocation(line: 99, column: 13, scope: !72)
!125 = !{!126, !126, i64 0}
!126 = !{!"any pointer", !86, i64 0}
!127 = !DILocation(line: 99, column: 35, scope: !72)
!128 = !DILocation(line: 99, column: 5, scope: !72)
!129 = !DILocation(line: 100, column: 13, scope: !72)
!130 = !DILocation(line: 100, column: 5, scope: !72)
!131 = !DILocation(line: 101, column: 13, scope: !72)
!132 = !DILocation(line: 101, column: 5, scope: !72)
!133 = !DILocation(line: 102, column: 13, scope: !72)
!134 = !DILocation(line: 102, column: 35, scope: !72)
!135 = !DILocation(line: 102, column: 5, scope: !72)
!136 = !DILocation(line: 103, column: 6, scope: !72)
!137 = distinct !{!137, !115, !138, !139, !140}
!138 = !DILocation(line: 104, column: 3, scope: !31)
!139 = !{!"llvm.loop.mustprogress"}
!140 = !{!"llvm.loop.unroll.disable"}
!141 = !DILocation(line: 105, column: 11, scope: !31)
!142 = !DILocation(line: 105, column: 3, scope: !31)
!143 = !DILocation(line: 106, column: 3, scope: !31)
!144 = !DILocation(line: 107, column: 3, scope: !31)
!145 = !DILocation(line: 109, column: 1, scope: !31)
!146 = !DILocation(line: 108, column: 3, scope: !31)
!147 = !DISubprogram(name: "yk_mt_new", scope: !43, file: !43, line: 40, type: !148, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!148 = !DISubroutineType(types: !149)
!149 = !{!41, !35}
!150 = !DISubprogram(name: "yk_mt_hot_threshold_set", scope: !43, file: !43, line: 55, type: !151, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!151 = !DISubroutineType(types: !152)
!152 = !{null, !41, !153}
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "YkHotThreshold", file: !43, line: 26, baseType: !61)
!154 = !DISubprogram(name: "yk_location_new", scope: !43, file: !43, line: 65, type: !155, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!155 = !DISubroutineType(types: !156)
!156 = !{!46}
!157 = !DISubprogram(name: "yk_mt_control_point", scope: !43, file: !43, line: 52, type: !158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !41, !160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!161 = !DISubprogram(name: "fprintf", scope: !162, file: !162, line: 350, type: !163, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!162 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!163 = !DISubroutineType(types: !164)
!164 = !{!34, !165, !223, null}
!165 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !168, line: 7, baseType: !169)
!168 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !170, line: 49, size: 1728, elements: !171)
!170 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!171 = !{!172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !187, !189, !190, !191, !194, !195, !197, !201, !204, !206, !209, !212, !213, !215, !218, !219}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !169, file: !170, line: 51, baseType: !34, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !169, file: !170, line: 54, baseType: !36, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !169, file: !170, line: 55, baseType: !36, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !169, file: !170, line: 56, baseType: !36, size: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !169, file: !170, line: 57, baseType: !36, size: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !169, file: !170, line: 58, baseType: !36, size: 64, offset: 320)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !169, file: !170, line: 59, baseType: !36, size: 64, offset: 384)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !169, file: !170, line: 60, baseType: !36, size: 64, offset: 448)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !169, file: !170, line: 61, baseType: !36, size: 64, offset: 512)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !169, file: !170, line: 64, baseType: !36, size: 64, offset: 576)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !169, file: !170, line: 65, baseType: !36, size: 64, offset: 640)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !169, file: !170, line: 66, baseType: !36, size: 64, offset: 704)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !169, file: !170, line: 68, baseType: !185, size: 64, offset: 768)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !170, line: 36, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !169, file: !170, line: 70, baseType: !188, size: 64, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !169, file: !170, line: 72, baseType: !34, size: 32, offset: 896)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !169, file: !170, line: 73, baseType: !34, size: 32, offset: 928)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !169, file: !170, line: 74, baseType: !192, size: 64, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !58, line: 152, baseType: !193)
!193 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !169, file: !170, line: 77, baseType: !59, size: 16, offset: 1024)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !169, file: !170, line: 78, baseType: !196, size: 8, offset: 1040)
!196 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !169, file: !170, line: 79, baseType: !198, size: 8, offset: 1048)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 1)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !169, file: !170, line: 81, baseType: !202, size: 64, offset: 1088)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !170, line: 43, baseType: null)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !169, file: !170, line: 89, baseType: !205, size: 64, offset: 1152)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !58, line: 153, baseType: !193)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !169, file: !170, line: 91, baseType: !207, size: 64, offset: 1216)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !170, line: 37, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !169, file: !170, line: 92, baseType: !210, size: 64, offset: 1280)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !170, line: 38, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !169, file: !170, line: 93, baseType: !188, size: 64, offset: 1344)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !169, file: !170, line: 94, baseType: !214, size: 64, offset: 1408)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !169, file: !170, line: 95, baseType: !216, size: 64, offset: 1472)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !217, line: 13, baseType: !52)
!217 = !DIFile(filename: "target/debug/ykllvm/lib/clang/18/include/__stddef_size_t.h", directory: "/home/pd/git-repos/research/yk-fork", checksumkind: CSK_MD5, checksum: "405db6ea5fb824de326715f26fa9fab5")
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !169, file: !170, line: 96, baseType: !34, size: 32, offset: 1536)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !169, file: !170, line: 98, baseType: !220, size: 160, offset: 1568)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 20)
!223 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!226 = !DISubprogram(name: "yk_location_drop", scope: !43, file: !43, line: 79, type: !227, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !46}
!229 = !DISubprogram(name: "yk_mt_shutdown", scope: !43, file: !43, line: 45, type: !230, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !41}
!232 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 77, type: !32, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !21, retainedNodes: !233)
!233 = !{!234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !245, !246, !247}
!234 = !DILocalVariable(name: "argc", arg: 1, scope: !232, file: !2, line: 77, type: !34)
!235 = !DILocalVariable(name: "argv", arg: 2, scope: !232, file: !2, line: 77, type: !35)
!236 = !DILocalVariable(name: "mt", scope: !232, file: !2, line: 78, type: !41)
!237 = !DILocalVariable(name: "loc", scope: !232, file: !2, line: 80, type: !46)
!238 = !DILocalVariable(name: "i", scope: !232, file: !2, line: 82, type: !34)
!239 = !DILocalVariable(name: "num1", scope: !232, file: !2, line: 83, type: !55)
!240 = !DILocalVariable(name: "num2", scope: !232, file: !2, line: 84, type: !61)
!241 = !DILocalVariable(name: "num3", scope: !232, file: !2, line: 85, type: !65)
!242 = !DILocalVariable(name: "num4", scope: !232, file: !2, line: 86, type: !68)
!243 = !DILocalVariable(name: "udiv", scope: !244, file: !2, line: 95, type: !55)
!244 = distinct !DILexicalBlock(scope: !232, file: !2, line: 93, column: 17)
!245 = !DILocalVariable(name: "udiv2", scope: !244, file: !2, line: 96, type: !61)
!246 = !DILocalVariable(name: "udiv3", scope: !244, file: !2, line: 97, type: !65)
!247 = !DILocalVariable(name: "udiv4", scope: !244, file: !2, line: 98, type: !68)
!248 = !DILocation(line: 0, scope: !232)
!249 = !DILocation(line: 78, column: 14, scope: !232)
!250 = !DILocation(line: 79, column: 3, scope: !232)
!251 = !DILocation(line: 80, column: 3, scope: !232)
!252 = !DILocation(line: 80, column: 14, scope: !232)
!253 = !DILocation(line: 80, column: 20, scope: !232)
!254 = !DILocation(line: 82, column: 3, scope: !232)
!255 = !DILocation(line: 82, column: 7, scope: !232)
!256 = !DILocation(line: 83, column: 3, scope: !232)
!257 = !DILocation(line: 83, column: 12, scope: !232)
!258 = !DILocation(line: 84, column: 3, scope: !232)
!259 = !DILocation(line: 84, column: 12, scope: !232)
!260 = !DILocation(line: 85, column: 3, scope: !232)
!261 = !DILocation(line: 85, column: 12, scope: !232)
!262 = !DILocation(line: 86, column: 3, scope: !232)
!263 = !DILocation(line: 86, column: 11, scope: !232)
!264 = !DILocation(line: 87, column: 3, scope: !232)
!265 = !DILocation(line: 88, column: 3, scope: !232)
!266 = !DILocation(line: 89, column: 3, scope: !232)
!267 = !DILocation(line: 90, column: 3, scope: !232)
!268 = !DILocation(line: 91, column: 3, scope: !232)
!269 = !DILocation(line: 92, column: 3, scope: !232)
!270 = !DILocation(line: 93, column: 10, scope: !232)
!271 = !DILocation(line: 93, column: 12, scope: !232)
!272 = !DILocation(line: 93, column: 3, scope: !232)
!273 = !DILocation(line: 94, column: 5, scope: !244)
!274 = !DILocation(line: 95, column: 21, scope: !244)
!275 = !DILocation(line: 0, scope: !244)
!276 = !DILocation(line: 96, column: 22, scope: !244)
!277 = !DILocation(line: 96, column: 27, scope: !244)
!278 = !DILocation(line: 97, column: 22, scope: !244)
